# coding=utf-8
# author = cjb

"""
课程目标
熟练掌握常见运算符及表达式

课程内容
a.常见运算符及表达式
b.算数运算符
c.逻辑运算符
d.比较运算符
e.成员运算符
f.运算符优先级



a.常见运算符及表达式
1.算数运算符
2.逻辑运算符
3.比较运算符
4.成员运算符

b.算数运算符
1.算数运算符应用场景
	1>计算工资
	2>计算员工
	3>统计网站在线用户数量
	4>统计订单总额
	5>app记录跑了多少步
2.算数运算符例子
	+	两个对象的和
	-	两个对象的差
	*	两个对象的积
	/	两个对象的商
	%	取余数
	**	幂
	//	取整
	注意：python2前操作整数会生略小数部分，如果是浮点类型就会保持小数
	python3中都是真除(无论任何类型都会保持小数部分)
3.比较运算符
1.比较运算符应用场景
	1>年终奖、项目奖金分配
	2>登录网站输入用户名和密码
	3>判断订单是否打折
2.比较运算符例子
	==	等于
	!=	不等于
	>	大于
	<	小于
	>=	大于等于
	<=	小于等于
	注意：比较运算符返回的值是True或者False
4.逻辑运算符
1.逻辑运算符应用场景
	1.taobao搜索地区是深圳，售价200以下的手机
	2.注册用户时候可以使用用户密码、QQ、微信
	3.快递青海不包邮
2.逻辑运算符例子
	and	同时满足条件
	or	满足一个条件即可
	not	不满足条件

5.成员运算符
1.成员运算符应用场景
	1>用户名是否被注册过
	2>黑名单是否开启
	3>淘宝手机多个品牌
	4>购物车勾选商品
2.成员运算符例子
	1>in	如果在指定序列中找到值，返回真，否则返回假
	2>not in 如果在指定序列中哦没有找到该值，返回真，否则为假

6.运算符优先级
	**	  指数(幂
    * / % //  乘 除 模 取整
	+   -     加减
	<= < > >= 比较
	in not in 成员
	not or and 逻辑
	&	   位
	补充：is 和==区别：is是比较对象的，==是比较对象的值的

"""




