# coding=utf-8
# author = cjb

"""
学习目标
熟练掌握分支流程控制语句

课程内容
a.条件判断应用场景
b.条件判断例子


a.条件判断应用场景
	1.订单是否有收货地址
	2.用户登录时候用户名、密码是否匹配
	3.年终奖金发放
	4.结合运算符进行判断

b.条件判断例子
	1.单分支语句
	只针对一个语句进行判断(可以有多个条件)
	if	判断语句:
		执行语句
	例子：
	假如我是总统:
		打印扯淡！！
	2.双分支语句
	针对两个语句进行判断，如果第一个不满足，就一定满足第二个
	if	判断语句:
		执行语句
	else:
		执行语句
	例子：
	假如我是高副帅:
		打印妹子多多
	如果不是上面情况：
		洗洗睡吧
	3.多分支语句
	针对多个语句进行判断，从上到下进行判断
	if	判断语句：
		执行语句
	elif	判断语句：
		执行语句
	...
	else:
		执行语句
	例子:
	假如我做飞机回家：
		票价特别贵！
	假如我坐火车回家:
		时间比较长
	假如我走路回家：
		准备好小盒
	其他:
		不考虑
	注意：
	1.每个判断语句后面都要使用冒号，冒号下面接下来是满足你条件后所需要做的事情
	2.使用缩进划分语句块，相同缩进组成在一起形成语句块
	3.python中没有switch-case语句
	4.一个判断语句中可以嵌入多个判断语句

1.分析社保信息，输入工资，计算出对应社保缴费信息，计算最后到手工资有多少
详细说明：https://zhidao.baidu.com/question/551470542.html
2.编写月工资计算器，输入月工资，输入出勤天数，加班天数，计算出本月的收入应该是多少
详细说明：https://zhidao.baidu.com/question/53022503.html?loc_ans=183345817
3.计算个人所得税，输入工资，输出所缴纳个人所得税
详细说明：https://baike.baidu.com/item/%E4%B8%AA%E4%BA%BA%E6%89%80%E5%BE%97%E7%A8%8E%E7%A8%8E%E7%8E%87%E8%A1%A8/2552067
4.编写一个人生倒计时计算器，输入目标年龄，判断还能活多久
"""

# 1
gongzi = 16000

if gongzi:
    daoshou = gongzi * 0.9
    print('到手工资：', daoshou)

